Revit 2027 API
LinePatternSegment Constructor
 Creates a line pattern segment.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LinePatternSegment()
Public Sub New
public:
LinePatternSegment()
new : unit -> LinePatternSegment
See Also
Reference
LinePatternSegment Class
LinePatternSegment Overload
Autodesk.Revit.DB Namespace